apache/nuttx/arch/arm/src/stm32h7/chip/stm32h7x3xx_dma.h
#define STM32_MDMA_CXMAR(x)       (STM32_MDMA_BASE+STM32_MDMA_CXMAR_OFFSET(x))
#define STM32_MDMA_C0MAR          (STM32_MDMA_BASE+STM32_MDMA_C0MAR_OFFSET)
#define STM32_MDMA_C1MAR          (STM32_MDMA_BASE+STM32_MDMA_C1MAR_OFFSET)
#define STM32_MDMA_C2MAR          (STM32_MDMA_BASE+STM32_MDMA_C2MAR_OFFSET)
#define STM32_MDMA_C3MAR          (STM32_MDMA_BASE+STM32_MDMA_C3MAR_OFFSET)
#define STM32_MDMA_C4MAR          (STM32_MDMA_BASE+STM32_MDMA_C4MAR_OFFSET)
#define STM32_MDMA_C5MAR          (STM32_MDMA_BASE+STM32_MDMA_C5MAR_OFFSET)
#define STM32_MDMA_C6MAR          (STM32_MDMA_BASE+STM32_MDMA_C6MAR_OFFSET)
#define STM32_MDMA_C7MAR          (STM32_MDMA_BASE+STM32_MDMA_C7MAR_OFFSET)
#define STM32_MDMA_C8MAR          (STM32_MDMA_BASE+STM32_MDMA_C8MAR_OFFSET)
#define STM32_MDMA_C9MAR          (STM32_MDMA_BASE+STM32_MDMA_C9MAR_OFFSET)
#define STM32_MDMA_C10MAR         (STM32_MDMA_BASE+STM32_MDMA_C10MAR_OFFSET)
#define STM32_MDMA_C11MAR         (STM32_MDMA_BASE+STM32_MDMA_C11MAR_OFFSET)
#define STM32_MDMA_C12MAR         (STM32_MDMA_BASE+STM32_MDMA_C12MAR_OFFSET)
#define STM32_MDMA_C13MAR         (STM32_MDMA_BASE+STM32_MDMA_C13MAR_OFFSET)
#define STM32_MDMA_C14MAR         (STM32_MDMA_BASE+STM32_MDMA_C14MAR_OFFSET)
#define STM32_MDMA_C15MAR         (STM32_MDMA_BASE+STM32_MDMA_C15MAR_OFFSET)

#define STM32_MDMA_CXMDR(x)       (STM32_MDMA_BASE+STM32_MDMA_CXMDR_OFFSET(x))
#define STM32_MDMA_C0MDR          (STM32_MDMA_BASE+STM32_MDMA_C0MDR_OFFSET)
#define STM32_MDMA_C1MDR          (STM32_MDMA_BASE+STM32_MDMA_C1MDR_OFFSET)
#define STM32_MDMA_C2MDR          (STM32_MDMA_BASE+STM32_MDMA_C2MDR_OFFSET)
#define STM32_MDMA_C3MDR          (STM32_MDMA_BASE+STM32_MDMA_C3MDR_OFFSET)
#define STM32_MDMA_C4MDR          (STM32_MDMA_BASE+STM32_MDMA_C4MDR_OFFSET)
#define STM32_MDMA_C5MDR          (STM32_MDMA_BASE+STM32_MDMA_C5MDR_OFFSET)
#define STM32_MDMA_C6MDR          (STM32_MDMA_BASE+STM32_MDMA_C6MDR_OFFSET)
#define STM32_MDMA_C7MDR          (STM32_MDMA_BASE+STM32_MDMA_C7MDR_OFFSET)
#define STM32_MDMA_C8MDR          (STM32_MDMA_BASE+STM32_MDMA_C8MDR_OFFSET)
#define STM32_MDMA_C9MDR          (STM32_MDMA_BASE+STM32_MDMA_C9MDR_OFFSET)
#define STM32_MDMA_C10MDR         (STM32_MDMA_BASE+STM32_MDMA_C10MDR_OFFSET)
#define STM32_MDMA_C11MDR         (STM32_MDMA_BASE+STM32_MDMA_C11MDR_OFFSET)
#define STM32_MDMA_C12MDR         (STM32_MDMA_BASE+STM32_MDMA_C12MDR_OFFSET)
#define STM32_MDMA_C13MDR         (STM32_MDMA_BASE+STM32_MDMA_C13MDR_OFFSET)
#define STM32_MDMA_C14MDR         (STM32_MDMA_BASE+STM32_MDMA_C14MDR_OFFSET)
#define STM32_MDMA_C15MDR         (STM32_MDMA_BASE+STM32_MDMA_C15MDR_OFFSET)

/* Register Bitfield Definitions ****************************************************/

/* TODO: MDMA global interrupt/status register */

/* TODO: MDMA channel x interrupt/status register*/

/* TODO: MDMA channel x interrupt flag clear register */

/* TODO: MDMA channel x error status register */

/* TODO: MDMA channel x control register */

/* TODO: MDMA channel x control register */

/* TODO: MDMA channel x block number of data register */

/* TODO: MDMA channel x source address register */

/* TODO: MDMA channel x destination address register */

/* TODO: MDMA channel x block repeat address update register */

/* TODO: MDMA channel x link address register */

/* TODO: MDMA channel x trigger and bus selection register */

/* TODO: MDMA channel x mask address register */

/* TODO: MDMA channel x mask data register */

/* BDMA ******************************************************************************/

/* Register Offsets *****************************************************************/

#define STM32_BDMA_ISR_OFFSET       0x0000 /* BDMA interrupt status register */
#define STM32_BDMA_IFCR_OFFSET      0x0004 /* BDMA interrupt flag clear register */
#define STM32_BDMA_CCRX_OFFSET(x)   (0x0008+x*0x0014) /* BDMA channel x configuration register */
#define STM32_BDMA_CCR0_OFFSET      STM32_BDMA_CCR0_OFFSET
#define STM32_BDMA_CCR1_OFFSET      STM32_BDMA_CCR1_OFFSET
#define STM32_BDMA_CCR2_OFFSET      STM32_BDMA_CCR2_OFFSET
#define STM32_BDMA_CCR3_OFFSET      STM32_BDMA_CCR3_OFFSET
#define STM32_BDMA_CCR4_OFFSET      STM32_BDMA_CCR4_OFFSET
#define STM32_BDMA_CCR5_OFFSET      STM32_BDMA_CCR5_OFFSET
#define STM32_BDMA_CCR6_OFFSET      STM32_BDMA_CCR6_OFFSET
#define STM32_BDMA_CCR7_OFFSET      STM32_BDMA_CCR7_OFFSET
#define STM32_BDMA_CNDTRX_OFFSET(x) (0x000C+x*0x0014) /* BDMA channel x number of data to transfer register */
#define STM32_BDMA_CNDTR0_OFFSET    STM32_BDMA_CNDTR0_OFFSET
#define STM32_BDMA_CNDTR1_OFFSET    STM32_BDMA_CNDTR1_OFFSET
#define STM32_BDMA_CNDTR2_OFFSET    STM32_BDMA_CNDTR2_OFFSET
#define STM32_BDMA_CNDTR3_OFFSET    STM32_BDMA_CNDTR3_OFFSET
#define STM32_BDMA_CNDTR4_OFFSET    STM32_BDMA_CNDTR4_OFFSET
#define STM32_BDMA_CNDTR5_OFFSET    STM32_BDMA_CNDTR5_OFFSET
#define STM32_BDMA_CNDTR6_OFFSET    STM32_BDMA_CNDTR6_OFFSET
#define STM32_BDMA_CNDTR7_OFFSET    STM32_BDMA_CNDTR7_OFFSET
#define STM32_BDMA_CPARX_OFFSET(x) (0x0010+x*0x0014) /* BDMA channel x peripheral address register */
#define STM32_BDMA_CPAR0_OFFSET    STM32_BDMA_CPAR0_OFFSET
#define STM32_BDMA_CPAR1_OFFSET    STM32_BDMA_CPAR1_OFFSET
#define STM32_BDMA_CPAR2_OFFSET    STM32_BDMA_CPAR2_OFFSET
#define STM32_BDMA_CPAR3_OFFSET    STM32_BDMA_CPAR3_OFFSET
#define STM32_BDMA_CPAR4_OFFSET    STM32_BDMA_CPAR4_OFFSET
#define STM32_BDMA_CPAR5_OFFSET    STM32_BDMA_CPAR5_OFFSET
#define STM32_BDMA_CPAR6_OFFSET    STM32_BDMA_CPAR6_OFFSET
#define STM32_BDMA_CPAR7_OFFSET    STM32_BDMA_CPAR7_OFFSET
#define STM32_BDMA_CM0ARX_OFFSET(x) (0x0014+x*0x0014) /* BDMA channel x memory 0 address register */
#define STM32_BDMA_CM0AR0_OFFSET    STM32_BDMA_CM0AR0_OFFSET
#define STM32_BDMA_CM0AR1_OFFSET    STM32_BDMA_CM0AR1_OFFSET
#define STM32_BDMA_CM0AR2_OFFSET    STM32_BDMA_CM0AR2_OFFSET
#define STM32_BDMA_CM0AR3_OFFSET    STM32_BDMA_CM0AR3_OFFSET
#define STM32_BDMA_CM0AR4_OFFSET    STM32_BDMA_CM0AR4_OFFSET
#define STM32_BDMA_CM0AR5_OFFSET    STM32_BDMA_CM0AR5_OFFSET
#define STM32_BDMA_CM0AR6_OFFSET    STM32_BDMA_CM0AR6_OFFSET
#define STM32_BDMA_CM0AR7_OFFSET    STM32_BDMA_CM0AR7_OFFSET
#define STM32_BDMA_CM1ARX_OFFSET(x) (0x0018+x*0x0014) /* BDMA channel x memory 1 address register */
#define STM32_BDMA_CM1AR0_OFFSET    STM32_BDMA_CM1AR0_OFFSET
#define STM32_BDMA_CM1AR1_OFFSET    STM32_BDMA_CM1AR1_OFFSET
#define STM32_BDMA_CM1AR2_OFFSET    STM32_BDMA_CM1AR2_OFFSET
#define STM32_BDMA_CM1AR3_OFFSET    STM32_BDMA_CM1AR3_OFFSET
#define STM32_BDMA_CM1AR4_OFFSET    STM32_BDMA_CM1AR4_OFFSET
#define STM32_BDMA_CM1AR5_OFFSET    STM32_BDMA_CM1AR5_OFFSET
#define STM32_BDMA_CM1AR6_OFFSET    STM32_BDMA_CM1AR6_OFFSET
#define STM32_BDMA_CM1AR7_OFFSET    STM32_BDMA_CM1AR7_OFFSET

/* Register Addresses ***************************************************************/

